saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>EFM32LGxxx_DFP</name>
  <description>Silicon Labs EFM32 Leopard Gecko Series Device Support</description>

  <releases>
    <release version="1.6.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EFM32LG_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EFM32LG_DFP.
    </release>
    <release version="1.5.0" date="2017-06-22">
      Updated device support files to V5.1.3.
      Updated Flash Algorithms to 5.2.0.
      Updated SVD files to V5.2.1.
      Updated emlib, emdrv to V5.1.3.
      Updated documentation.
    </release>
    <release version="1.4.0" date="2016-04-22">
      Updated device support files to V4.2.0.
      Updated emlib, emdrv to V4.2.0.
    </release>
    <release version="1.3.0" date="2015-07-31">
      Updated device support files to V4.0.0.
      Added emlib support.
      Added EFM32LG900 devices.
    </release>
    <release version="1.2.0" date="2015-05-22">
      Added EFM32LG360 devices.
    </release>
    <release version="1.1.0" date="2015-04-10">
      Updated Flash Algorithm and set RAMstart, RAMsize to algorithm in device description.
      Updated EFM32LG device support files.
      Updated emlib to V3.20.13.
      Updated documentation.
      Changed Device Vendor to '"Silicon Labs:21".
    </release>
    <release version="1.0.1" date="2014-02-20">
      Device description updated with features and flash programming algorithms
    </release>
    <release version="1.0.0">
      First Release version of EFM32LG Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32LG</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32LG Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="48000000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <book name="Documents/EFM32LG-RM.pdf"              title="EFM32LG Reference Manual"/>
      <book name="Documents/efm32lg-datasheet.pdf"       title="EFM32LG Data Sheet"/>

      <description>
Silicon Labs' EFM32™ Leopard Gecko 32-bit microcontroller family offers up to 256 kB of flash memory with the added option of embedded USB connectivity, direct drive TFT and CPU speeds up to 48 MHz.

Based on the powerful ARM® Cortex®-M3 core, the Leopard Gecko family features innovative low energy techniques, short wake-up time from energy saving modes and a wide selection of peripherals, making it ideal for battery operated applications and other systems requiring high performance and low-energy consumption.
      </description>

      <feature type="AnalogOther"   n="3"                           name="Operational Amplifier"/>
      <feature type="Other"         n="1"                           name="Low Energy Sensor Interface (LESENSE)"/>

      <!-- ************************  Subfamily 'EFM32LG230'  **************************** -->
      <subFamily DsubFamily="EFM32LG230">
        <feature type="IOs"           n="56"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG230F128'  ***************************** -->
        <device Dname="EFM32LG230F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG230F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG230F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG230F256'  ***************************** -->
        <device Dname="EFM32LG230F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG230F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG230F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG230F64'  ***************************** -->
        <device Dname="EFM32LG230F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG230F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG230F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG232'  **************************** -->
      <subFamily DsubFamily="EFM32LG232">
        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG232F128'  ***************************** -->
        <device Dname="EFM32LG232F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG232F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG232F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

