saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'EFM32LG232F256'  ***************************** -->
        <device Dname="EFM32LG232F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG232F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG232F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG232F64'  ***************************** -->
        <device Dname="EFM32LG232F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG232F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG232F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG280'  **************************** -->
      <subFamily DsubFamily="EFM32LG280">
        <feature type="IOs"           n="86"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG280F128'  ***************************** -->
        <device Dname="EFM32LG280F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG280F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG280F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG280F256'  ***************************** -->
        <device Dname="EFM32LG280F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG280F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG280F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG280F64'  ***************************** -->
        <device Dname="EFM32LG280F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG280F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG280F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG290'  **************************** -->
      <subFamily DsubFamily="EFM32LG290">
        <feature type="IOs"           n="90"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG290F128'  ***************************** -->
        <device Dname="EFM32LG290F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG290F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG290F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG290F256'  ***************************** -->
        <device Dname="EFM32LG290F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG290F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG290F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG290F64'  ***************************** -->
        <device Dname="EFM32LG290F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG290F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG290F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG295'  **************************** -->
      <subFamily DsubFamily="EFM32LG295">
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG295F128'  ***************************** -->
        <device Dname="EFM32LG295F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG295F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG295F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG295F256'  ***************************** -->
        <device Dname="EFM32LG295F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG295F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG295F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG295F64'  ***************************** -->
        <device Dname="EFM32LG295F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG295F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG295F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG330'  **************************** -->
      <subFamily DsubFamily="EFM32LG330">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG330F128'  ***************************** -->
        <device Dname="EFM32LG330F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG330F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG330F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

