saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'EFM32LG330F256'  ***************************** -->
        <device Dname="EFM32LG330F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG330F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG330F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG330F64'  ***************************** -->
        <device Dname="EFM32LG330F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG330F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG330F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG332'  **************************** -->
      <subFamily DsubFamily="EFM32LG332">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="50"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG332F128'  ***************************** -->
        <device Dname="EFM32LG332F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG332F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG332F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG332F256'  ***************************** -->
        <device Dname="EFM32LG332F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG332F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG332F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG332F64'  ***************************** -->
        <device Dname="EFM32LG332F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG332F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG332F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG360'  **************************** -->
      <subFamily DsubFamily="EFM32LG360">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="65"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG360F128'  ***************************** -->
        <device Dname="EFM32LG360F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG360F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG360F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG360F256'  ***************************** -->
        <device Dname="EFM32LG360F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG360F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG360F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG360F64'  ***************************** -->
        <device Dname="EFM32LG360F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG360F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG360F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

