saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
      <!-- ************************  Subfamily 'EFM32LG380'  **************************** -->
      <subFamily DsubFamily="EFM32LG380">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="83"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG380F128'  ***************************** -->
        <device Dname="EFM32LG380F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG380F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG380F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG380F256'  ***************************** -->
        <device Dname="EFM32LG380F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG380F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG380F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG380F64'  ***************************** -->
        <device Dname="EFM32LG380F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG380F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG380F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG390'  **************************** -->
      <subFamily DsubFamily="EFM32LG390">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="87"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG390F128'  ***************************** -->
        <device Dname="EFM32LG390F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG390F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG390F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG390F256'  ***************************** -->
        <device Dname="EFM32LG390F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG390F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG390F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG390F64'  ***************************** -->
        <device Dname="EFM32LG390F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG390F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG390F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG395'  **************************** -->
      <subFamily DsubFamily="EFM32LG395">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG395F128'  ***************************** -->
        <device Dname="EFM32LG395F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG395F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG395F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG395F256'  ***************************** -->
        <device Dname="EFM32LG395F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG395F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG395F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG395F64'  ***************************** -->
        <device Dname="EFM32LG395F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG395F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG395F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

