saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'EFM32LG880F64'  ***************************** -->
        <device Dname="EFM32LG880F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG880F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG880F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG890'  **************************** -->
      <subFamily DsubFamily="EFM32LG890">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="90"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG890F128'  ***************************** -->
        <device Dname="EFM32LG890F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG890F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG890F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG890F256'  ***************************** -->
        <device Dname="EFM32LG890F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG890F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG890F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG890F64'  ***************************** -->
        <device Dname="EFM32LG890F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG890F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG890F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG895'  **************************** -->
      <subFamily DsubFamily="EFM32LG895">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG895F128'  ***************************** -->
        <device Dname="EFM32LG895F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG895F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG895F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG895F256'  ***************************** -->
        <device Dname="EFM32LG895F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG895F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG895F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG895F64'  ***************************** -->
        <device Dname="EFM32LG895F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG895F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG895F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG900'  **************************** -->
      <subFamily DsubFamily="EFM32LG900">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG900F256'  ***************************** -->
        <device Dname="EFM32LG900F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG900F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG900F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG940'  **************************** -->
      <subFamily DsubFamily="EFM32LG940">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>

