saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
        <!-- *************************  Device 'EFM32LG940F128'  ***************************** -->
        <device Dname="EFM32LG940F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG940F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG940F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG940F256'  ***************************** -->
        <device Dname="EFM32LG940F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG940F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG940F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG940F64'  ***************************** -->
        <device Dname="EFM32LG940F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG940F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG940F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG942'  **************************** -->
      <subFamily DsubFamily="EFM32LG942">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="50"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG942F128'  ***************************** -->
        <device Dname="EFM32LG942F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG942F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG942F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG942F256'  ***************************** -->
        <device Dname="EFM32LG942F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG942F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG942F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG942F64'  ***************************** -->
        <device Dname="EFM32LG942F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG942F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG942F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG980'  **************************** -->
      <subFamily DsubFamily="EFM32LG980">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="83"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG980F128'  ***************************** -->
        <device Dname="EFM32LG980F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG980F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG980F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG980F256'  ***************************** -->
        <device Dname="EFM32LG980F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG980F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG980F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG980F64'  ***************************** -->
        <device Dname="EFM32LG980F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG980F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG980F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

