saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.EFM32LGxxx_DFP.1.6.0.pdsc
      <!-- ************************  Subfamily 'EFM32LG990'  **************************** -->
      <subFamily DsubFamily="EFM32LG990">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="87"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG990F128'  ***************************** -->
        <device Dname="EFM32LG990F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG990F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG990F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG990F256'  ***************************** -->
        <device Dname="EFM32LG990F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG990F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG990F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG990F64'  ***************************** -->
        <device Dname="EFM32LG990F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG990F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG990F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32LG995'  **************************** -->
      <subFamily DsubFamily="EFM32LG995">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="93"                          name="General Purpose I/O pins"/>

        <!-- *************************  Device 'EFM32LG995F128'  ***************************** -->
        <device Dname="EFM32LG995F128">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG995F128"/>
          <debug svd="SVD/EFM32LG/EFM32LG995F128.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00020000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG995F256'  ***************************** -->
        <device Dname="EFM32LG995F256">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG995F256"/>
          <debug svd="SVD/EFM32LG/EFM32LG995F256.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00040000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00040000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>

        <!-- *************************  Device 'EFM32LG995F64'  ***************************** -->
        <device Dname="EFM32LG995F64">
          <compile header="Device/EFM32LG/Include/em_device.h"  define="EFM32LG995F64"/>
          <debug svd="SVD/EFM32LG/EFM32LG995F64.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00010000" default="1" startup="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" default="1" init   ="0"/>
          <algorithm name="Flash/EFM32LG.FLM" start="0x00000000" size="0x00010000" default="1" RAMstart="0x20000000" RAMsize="0x00008000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32LG">
      <description>Silicon Labs EFM32LG devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32LG*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32LG CMSIS">
      <description>Silicon Labs EFM32LG, CMSIS Core</description>
      <require condition="EFM32LG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32LG CMSIS GCC">
      <description>Silicon Labs EFM32LG devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32LG CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32LG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32LG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
